<a href="https://colab.research.google.com/github/Sihan-A/Pydata_2e_Chinese_Notebook/blob/main/ch06_%E6%95%B0%E6%8D%AE%E5%8A%A0%E8%BD%BD%E5%AD%98%E5%82%A8%E5%8F%8A%E6%96%87%E4%BB%B6%E6%A0%BC%E5%BC%8F.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 6 数据载入、储存及文件格式

In [ ]:
!git clone https://github.com/wesm/pydata-book.git
%cd /content/pydata-book

Cloning into 'pydata-book'...
remote: Enumerating objects: 447, done.
remote: Counting objects: 100% (7/7), done.
remote: Compressing objects: 100% (5/5), done.
remote: Total 447 (delta 2), reused 6 (delta 2), pack-reused 440
Receiving objects: 100% (447/447), 40.55 MiB | 11.40 MiB/s, done.
Resolving deltas: 100% (139/139), done.
Checking out files: 100% (210/210), done.
/content/pydata-book

In [ ]:
import numpy as np
import pandas as pd
import os
import matplotlib.pyplot as plt

In [ ]:
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

## 6.1 文本格式数据的读写

表6-1Pandas得解析函数


| 函数           | 说明                                                         |
| -------------- | ------------------------------------------------------------ |
| read_csv       | 从文件、URL、文件型对象中加载带分隔符的数据。默认分隔符为逗号 |
| read_table     | 从文件、URL、文件型对象中加载带分隔符的数据。默认分隔符为制表符('\t') |
| read_fwf       | 读取定宽列格式数据(也就是说，没有分隔符)                     |
| read_clipboard | 读取剪贴板中的数据，可以看做read_table的剪贴板版。再将网页转换为表格时很有用 |
| read_excel     | 从Excel的XLS或XLSX文件读取表格数据                           |
| read_hdf       | 读取pandas写的HDF5文件                                       |
| read_html      | 读取HTML文档中的所有表格                                     |
| read_json      | 读取JSON(JavaScript Object Notation)字符串中的数据           |
| read_msgpack   | 二进制格式编码的pandas数据                                   |
| read_pickle    | 读取Pythonpickle格式中存储的任意对象                         |
| read_sas       | 读取存储于SAS系统自定义存储格式的SAS数据集                   |
| read_sql       | (使用SQLAlchemy)读取SQL查询结果为pandas的DataFrame           |
| read_stats     | 读取Stata文件格式的数据集                                    |
| read_feather   | 读取Feather二进制文件格式                                    |

In [ ]:
examples_path = './examples/' # 设置路径
!cat ./examples/ex1.csv # 查看ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [ ]:
df = pd.read_csv(examples_path + 'ex1.csv') # read_csv读ex1.csv
df # 查看

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
pd.read_table(examples_path + 'ex1.csv', # read_table读ex1.csv
              sep=',') # 分隔符

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
!cat ./examples/ex2.csv # 查看ex2.csv，没有header行

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [ ]:
pd.read_csv(examples_path + 'ex2.csv', # read_csv读ex2.csv
            header=None) # 第一行设置为标题行 = None

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [ ]:
pd.read_csv(examples_path + 'ex2.csv', # read_csv读ex2.csv
            names=['a', 'b', 'c', 'd', 'message']) # column名的列表

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
names = ['a', 'b', 'c', 'd', 'message'] # 创建列表
pd.read_csv(examples_path + 'ex2.csv', # 导入数据
            names=names, # 把列表names传给columns取名names
            index_col='message') # 将名字为'message'的列设为index

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [ ]:
!cat ./examples/csv_mindex.csv # 查看csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [ ]:
pd.read_csv(examples_path + 'csv_mindex.csv') # read_csv读csv_mindex.csv

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [ ]:
parsed = pd.read_csv(examples_path + 'csv_mindex.csv', # 导入csv
                     index_col=['key1', 'key2']) # 将'key1'和'key2'两列设为index列
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [ ]:
list(open(examples_path + 'ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [ ]:
result = pd.read_table(examples_path + 'ex3.txt',
                       sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [ ]:
!cat ./examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [ ]:
pd.read_csv(examples_path + 'ex4.csv',
            skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
!cat ./examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [ ]:
result = pd.read_csv(examples_path + 'ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
result = pd.read_csv(examples_path + 'ex5.csv',
                     na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [ ]:
sentinels = {'message': ['foo', 'NA'],
             'something': ['two']}
pd.read_csv(examples_path + 'ex5.csv',
            na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

### 6.1.1 分块读入文本文件

In [ ]:
pd.options.display.max_rows = 10

In [ ]:
result = pd.read_csv(examples_path + 'ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [ ]:
pd.read_csv(examples_path + 'ex6.csv',
            nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [ ]:
chunker = pd.read_csv(examples_path + 'ex6.csv',
                      chunksize=1000)
chunker

In [ ]:
chunker = pd.read_csv(examples_path + 'ex6.csv',
                      chunksize=1000)

tot = pd.Series([],
                dtype=np.float64)
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

### 6.1.2 将数据写入文本格式

In [ ]:
data = pd.read_csv(examples_path + 'ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
# 写入csv文件
data.to_csv(examples_path + 'out.csv')
# 查看文件
!cat ./examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [ ]:
import sys
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [ ]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [ ]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [ ]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [ ]:
dates = pd.date_range('1/1/2000',
                      periods=7)
ts = pd.Series(np.arange(7),
               index=dates)
ts.to_csv(examples_path + 'tseries.csv')
!cat ./examples/tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

### 6.1.3 使用分隔格式

In [ ]:
!cat ./examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [ ]:
import csv
f = open(examples_path + 'ex7.csv')

reader = csv.reader(f)

In [ ]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [ ]:
with open(examples_path + 'ex7.csv') as f:
    lines = list(csv.reader(f))

In [ ]:
header, values = lines[0], lines[1:]

In [ ]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

```python
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

reader = csv.reader(f, dialect=my_dialect)
```

```python
reader = csv.reader(f, delimiter='|')
```

表6-2:一些read_csv和read_table函数参数

| 参数               | 说明                                                         |
| ------------------ | ------------------------------------------------------------ |
| `path`             | 表示文件系统位置、URL、文件型对象的字符串                    |
| `sep`或`delimiter` | 用于对行中各字段进行拆分的字符序列或正则表达式               |
| `header`           | 用作列名的行号。默认为0(第一行)，如果没有header行就应该设置为`None` |
| `index_col`        | 用作行索引的列编号或列名。可以是单个名称/数字或由多个名称/数字组成的列表(层次化索引) |
| `names`            | 用于结果的列名列表，结合header=None                          |
| `skiprows`         | 需要忽略的行数(从文件开始处算起)，或需要跳过的行号列表(从0开始) |
| `na_values`        | 一组用于替换NA的值                                           |
| `comment`          | 用于将注释信息从行尾拆分出去的字符(一个或多个)               |
| `parse_dates`      | 尝试将数据解析为日期，默认为False。<br/>如果为True，则尝试解析所有列。此外，还可以指定需要解析的一组列号或列名。<br/>如果列表的元素为列表或元组，就会将多个列组合到一起再进行日期解析工作(例如，日期/时间分别位于两个列中) |
| `keep_date_col`    | 如果连接多列解析日期，则保持参与连接的列。默认为False。      |
| `converters`       | 由列号/列名跟函数之间的映射关系组成的字典。例如，`{'foo':f}`会对foo列的所有值应用函数f |
| `dayfirst`         | 当解析有歧义的日期时，将其看做国际格式(例如，7/6/2012->June 7,2012)。默认为False |
| `date_parser`      | 用于解析日期的函数                                           |
| `nrows`            | 需要读取的行数(从文件开始处算起)                             |
| `iterator`         | 返回一个TextParser以便逐块读取文件                           |
| `chunksize`        | 文件块的大小(用于迭代)                                       |
| `skip_footer`      | 需要忽略的行数(从文件末尾处算起)                             |
| `verbose`          | 打印各种解析器输出信息，比如“非数值列中缺失值的数量”等       |
| `encoding`         | 用于unicode的文本编码格式。例如，`"utf-8"`表示用UTF-8编码的文本 |
| `squeeze`          | 如果数据经解析后仅含一列，则返回Series                       |
| `thousands`        | 千分位分隔符，如`','`或`'.'`                                 |

```python
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))
```

### 6.1.4 JSON数据

In [ ]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [ ]:
import json # 导入json模块
result = json.loads(obj) # json模块加载字典
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 30, 'name': 'Scott', 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [ ]:
asjson = json.dumps(result)
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [ ]:
siblings = pd.DataFrame(result['siblings'],
                        columns=['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [ ]:
!cat /content/drive/MyDrive/Pydata/examples/example.json

cat: /content/drive/MyDrive/Pydata/examples/example.json: No such file or directory

In [ ]:
data = pd.read_json(examples_path + 'example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [ ]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

### XML and HTML：网络抓取

1. lxml
2. Beautiful Soup
3. html5lib

In [ ]:
tables = pd.read_html(examples_path + 'fdic_failed_bank_list.html')
len(tables)

1

In [ ]:
failures = tables[0]
failures.head()

                      Bank Name  ...       Updated Date
0                   Allied Bank  ...  November 17, 2016
1  The Woodbury Banking Company  ...  November 17, 2016
2        First CornerStone Bank  ...  September 6, 2016
3            Trust Company Bank  ...  September 6, 2016
4    North Milwaukee State Bank  ...      June 16, 2016

[5 rows x 7 columns]

In [ ]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

#### 使用lxml.objectify解析XML

<INDICATOR>
  <INDICATOR_SEQ>373889</INDICATOR_SEQ>
  <PARENT_SEQ></PARENT_SEQ>
  <AGENCY_NAME>Metro-North Railroad</AGENCY_NAME>
  <INDICATOR_NAME>Escalator Availability</INDICATOR_NAME>
  <DESCRIPTION>Percent of the time that escalators are operational
  systemwide. The availability rate is based on physical observations performed
  the morning of regular business days only. This is a new indicator the agency
  began reporting in 2009.</DESCRIPTION>
  <PERIOD_YEAR>2011</PERIOD_YEAR>
  <PERIOD_MONTH>12</PERIOD_MONTH>
  <CATEGORY>Service Indicators</CATEGORY>
  <FREQUENCY>M</FREQUENCY>
  <DESIRED_CHANGE>U</DESIRED_CHANGE>
  <INDICATOR_UNIT>%</INDICATOR_UNIT>
  <DECIMAL_PLACES>1</DECIMAL_PLACES>
  <YTD_TARGET>97.00</YTD_TARGET>
  <YTD_ACTUAL></YTD_ACTUAL>
  <MONTHLY_TARGET>97.00</MONTHLY_TARGET>
  <MONTHLY_ACTUAL></MONTHLY_ACTUAL>
</INDICATOR>

In [ ]:
from lxml import objectify

path = './datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [ ]:
data = []

skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
               'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [ ]:
perf = pd.DataFrame(data)
perf.head()

            AGENCY_NAME  ... MONTHLY_ACTUAL
0  Metro-North Railroad  ...           96.9
1  Metro-North Railroad  ...             95
2  Metro-North Railroad  ...           96.9
3  Metro-North Railroad  ...           98.3
4  Metro-North Railroad  ...           95.8

[5 rows x 12 columns]

In [ ]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [ ]:
root
root.get('href')
root.text

'Google'

## 6.2 二进制格式

In [ ]:
frame = pd.read_csv('examples/ex1.csv')
frame
frame.to_pickle('examples/frame_pickle')

In [ ]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
!rm examples/frame_pickle

### 6.2.1 使用HDF5格式

HDF：Hierarchical Data Format分层数据格式

In [ ]:
frame = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [ ]:
store['obj1']

           a
0  -0.204708
1   0.478943
2  -0.519439
3  -0.555730
4   1.965781
..       ...
95  0.795253
96  0.118110
97 -0.748532
98  0.584970
99  0.152677

[100 rows x 1 columns]

In [ ]:
store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  1.007189
11 -1.296221
12  0.274992
13  0.228913
14  1.352917
15  0.886429

In [ ]:
store.close()

In [ ]:
frame.to_hdf('mydata.h5', 'obj3', format='table')
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0 -0.204708
1  0.478943
2 -0.519439
3 -0.555730
4  1.965781

In [ ]:
os.remove('mydata.h5')

### 6.2.2 读取Microsoft Excel文件

In [ ]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [ ]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [ ]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [ ]:
writer = pd.ExcelWriter('examples/ex2.xlsx')
frame.to_excel(writer, 'Sheet1')
writer.save()

In [ ]:
frame.to_excel('examples/ex2.xlsx')

In [ ]:
!rm examples/ex2.xlsx

## 6.3 与Web API交互

In [ ]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [ ]:
data = resp.json()
data[0]['title']

'Replace str::replace hack for getting module name from ImportError in __init__.py'

In [ ]:
issues = pd.DataFrame(data, columns=['number', 'title',
                                     'labels', 'state'])
issues

    number  ... state
0    43013  ...  open
1    43012  ...  open
2    43011  ...  open
3    43010  ...  open
4    43009  ...  open
..     ...  ...   ...
25   42973  ...  open
26   42972  ...  open
27   42971  ...  open
28   42970  ...  open
29   42968  ...  open

[30 rows x 4 columns]

## 6.4 与数据库交互

In [ ]:
import sqlite3
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
con = sqlite3.connect('mydata.sqlite')
con.execute(query)
con.commit()

In [ ]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [ ]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [ ]:
cursor.description
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [ ]:
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [ ]:
!rm mydata.sqlite

## Conclusion